cases/chpt6-proxyBlade-AM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       150150;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       150750;
    }
    btm_side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          15000;
        startFace       151350;
    }
    top_side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7500;
        startFace       166350;
    }
)

// ************************************************************************* //
