cases/chpt6-proxyBlade-AM/constant/old-dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh2D;

    // How often to refine
    refineInterval  1;
    // Field to be refinement on
    field           alpha.Phase2;
    // Refine field inbetween lower..upper
    lowerRefineLevel 0.05;
    upperRefineLevel 0.95;
    // If value < unrefineLevel unrefine
    unrefineLevel   5;

    // Have slower than 2:1 refinement
    nBufferLayers   1;

    nBufferLayersR   1;

    // Refine cells only up to maxRefinement levels
    maxRefinement   10;
    // Stop refinement if maxCells reached
    maxCells        200000;
    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    
    correctFluxes
    (
        (rhoPhi none)
        (kf0 none)
        (kf none)
        (ghf none)
        (kfAc none)
        (alphaPhi0.Phase1_0 none)
        (kf2 none)
        (phi none)
        (phi_0 none)
        (psiUB none)
        (nHatf none)
        (alphaPhi0.Phase1 none)
        (Jn none)
        (rhoPhiCp none)
    );
    // Write the refinement level as a volScalarField
    dumpLevel       true;



// ************************************************************************* //
