cases/chpt6-proxyBlade-AM/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This is for gallium in cavity

//phaseChange 1.0;
alpha1TControl 1.0;
alphaInterfaceCut 1;
meltInterface 1e-6;
alpha2Capture 0.0005;

//phases (Phase1 Phase2);
phases (Phase1 Phase2 Phase3);

sigma12         0;//0.18;
sigma13         0;
sigma23         0;
sigmaMetal      0;
sigmaMetalFlag  0;
/*
*/
D23             0;

k [1 1 -3 -1 0 0 0] 1;//0;
nu [0 2 -1 0 0 0 0] 2.98e-07;
rho [1 -3 0 0 0 0 0] 6000;
cp [0 2 -2 -1 0 0 0] 381.5;

nuEM    1;//2.97e-07;
k       16.3; 
//k k [1 1 -3 1 0 0 0] 1; // kg*m/s^3*k
/*
*/
k1 0.02;
k2 25;//24; //24 liquid, 40 solid?
k3  40;//40;//40;
nu1_shadow 1.48e-05;
nu2_shadow 2.97e-07;
nu3_shadow 3e-07;

k_weld 0;//40; 

multiplierBuoy 8e8;
multiplierBuoyG 0;//5e9;//1.6e6;
sourceTime 0;

dmdtRelaxAlpha 10;//2.5;
dmdtRelaxPressure 0;//-0.25;//-0.005;//.03;//25;//-0.005;

cp1 1000;
cp2 620;
cp3 530;

SuFudge 0;
testFudge 0.0;

dsigmadT 0;

meltingT 1690;

T_0 1690;

cp 500;

rhoRef 8e3;

htot htot [1 -1 -2 0 0 0 0] 1;

Lf 2.6e5;//334000; // water

//LfLimit true;
LfSmoothing true;

Tref 1690;


vsfRho true;
beta 0;//1.96e-5;

// Phase prop match stops spurious - reweight???
/*
phases
(
*/
Phase1 // air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
    cp              1000;
//    cp              381.5;
    k               0.2;//0.02;
    Pr              0.74;
}
/*
Phase1 // water
{
    transportModel  Newtonian;
    CTLE            0.0;//1e-6;
    nu              2.97e-07; 
    rho             8e3;//4140;
    cp              500;
    k               16.3;
}
*/

Phase2 // ice
{
    transportModel  Newtonian;
    Tref            1690;
    beta            0;//0.77;
    nu              2.97e-07; 
    rho             6881;
    cp              830;
    k               16.3;
    k2Opt           true;
    k2a             6.6;
    k2b             12.14e-3;
    k2c             0.0;
}

Phase3 // water
{
    transportModel  Newtonian;
    Tdep            true;
    Shomate         false;
    CTLE            0;//1e-6;
    nu              2.97e-07; 
    rho             7950;
    cp              490;
    a               412;
    b               0.2;
    c               -0.00002;
    k               16.3;
    k3Opt           true;
    k3a             6.31;
    k3b             27.2e-3;
    k3c             -7e-6;
}

// ************************************************************************* //
