cases/chpt6-proxyBlade-AM/0/alpha.Phase1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "120";
    object      alpha.Phase1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
54000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    btm
    {
        type            zeroGradient;
    }
    btm_side1Andside2Andside3
    {
        type            zeroGradient;
    }
    top_side1Andside2Andside3
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
